; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image5 - mode
	image0 - mode
	thermograph4 - mode
	spectrograph1 - mode
	spectrograph7 - mode
	spectrograph6 - mode
	image3 - mode
	thermograph2 - mode
	Star0 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star1 - direction
	GroundStation2 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph7)
	(supports instrument0 thermograph2)
	(supports instrument0 image3)
	(supports instrument0 spectrograph6)
	(supports instrument0 spectrograph1)
	(supports instrument0 image0)
	(supports instrument0 image5)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
)
(:goal (and
	(have_image Phenomenon7 image3)
	(have_image Phenomenon7 spectrograph6)
	(have_image Star8 spectrograph6)
	(have_image Planet9 image3)
	(have_image Planet10 spectrograph1)
	(have_image Planet10 spectrograph6)
	(have_image Phenomenon11 spectrograph6)
	(have_image Phenomenon11 thermograph2)
	(have_image Star12 image3)
))

)

; plan
1. (turn_to satellite0 groundstation2 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 star12 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star12)
   goals met: 0 of 9
5. (take_image satellite0 star12 instrument0 image3)
   added: (have_image star12 image3)
   goals met: 1 of 9
6. (turn_to satellite0 planet9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet9)
   goals met: 1 of 9
7. (take_image satellite0 planet9 instrument0 image3)
   added: (have_image planet9 image3)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon11 instrument0 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 3 of 9
10. (take_image satellite0 phenomenon11 instrument0 spectrograph6)
   added: (have_image phenomenon11 spectrograph6)
   goals met: 4 of 9
11. (turn_to satellite0 phenomenon7 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 9
12. (take_image satellite0 phenomenon7 instrument0 image3)
   added: (have_image phenomenon7 image3)
   goals met: 5 of 9
13. (take_image satellite0 phenomenon7 instrument0 spectrograph6)
   added: (have_image phenomenon7 spectrograph6)
   goals met: 6 of 9
14. (turn_to satellite0 planet10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet10)
   goals met: 6 of 9
15. (take_image satellite0 planet10 instrument0 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 7 of 9
16. (take_image satellite0 planet10 instrument0 spectrograph6)
   added: (have_image planet10 spectrograph6)
   goals met: 8 of 9
17. (turn_to satellite0 star8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star8)
   goals met: 8 of 9
18. (take_image satellite0 star8 instrument0 spectrograph6)
   added: (have_image star8 spectrograph6)
   goals met: 9 of 9
